---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
source: html/e98674fc-0a82-f7f5-5a22-de862506f7f7.htm
---
# RevitAPIPreEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.